app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def get
  	response = Product.all