app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id], :joins => [:product_pictures,:product_categories])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" = 2
SELECT "product_pictures".* FROM "product_pictures" WHERE "product_pictures"."product_id" = 2
SELECT "products".* FROM "products" INNER JOIN "product_pictures" ON "product_pictures"."product_id" = "products"."id" INNER JOIN "product_categories" ON "product_categories"."product_id" = "products"."id" WHERE "products"."id" = $1 LIMIT 1  [["id", "2"]]

  def get
    logger.debug params

    # conditions = { :is_published => true }
    # conditions['product_categories.category_id'] = { '$in' => params['categories'].split(',').to_a.to_s }

    join_query =  " LEFT OUTER JOIN product_pictures on product_pictures.product_id = products.id "
    join_query += " LEFT OUTER JOIN product_categories ON product_categories.product_id = products.id "
    join_query += " LEFT OUTER JOIN categories ON product_categories.category_id = categories.id "
    join_query += " WHERE products.is_published = true"

    join_query += " AND product_categories.category_id IN (#{params['categories']})" unless params['categories'].nil?
    sort_filter = params['sort'].nil? ? "products.position asc" : params['sort'] + " asc"

    response = Product.find(:all, :select => "products.*, product_pictures.*, categories.title as category_title",
                    :joins => join_query, :order => sort_filter)
---
SELECT products.*, product_pictures.*, categories.title as category_title FROM "products" LEFT OUTER JOIN product_pictures on product_pictures.product_id = products.id LEFT OUTER JOIN product_categories ON product_categories.product_id = products.id LEFT OUTER JOIN categories ON product_categories.category_id = categories.id WHERE products.is_published = true AND product_categories.category_id IN (1) ORDER BY products.position asc