app/views/products/index.html.erb


<% Product.all.each do |product| %>
---
SELECT "products".* FROM "products"