app/views/products/show.html.erb

				<ul>
					<% @product.product_categories.each do |pc| %>
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" = 2